In [1]:
import numpy as np
import pandas as pd

In [3]:
data = {
    'Category': ['A', 'B', 'A', 'B', 'A', 'B', 'A', 'B'], 
    'Store': ['S1', 'S1', 'S2', 'S2', 'S1', 'S2', 'S2', 'S1'], 
    'Sales': [100, 200, 150, 250, 120, 100, 200, 300], 
    'Quantity': [10, 15, 12, 18, 8, 20, 15, 25], 
    'Date': pd.date_range('2023-01-01', periods=8) 
}
df = pd.DataFrame(data)

df

  Category Store  Sales  Quantity       Date
0        A    S1    100        10 2023-01-01
1        B    S1    200        15 2023-01-02
2        A    S2    150        12 2023-01-03
3        B    S2    250        18 2023-01-04
4        A    S1    120         8 2023-01-05
5        B    S2    100        20 2023-01-06
6        A    S2    200        15 2023-01-07
7        B    S1    300        25 2023-01-08

### GROUP BY:

-> Group by category and calculate the sum of sales

In [ ]:
ctg = df.groupby("Category")
ctg

In [7]:
for i, j in ctg:   # লুপটি প্রতিটি গ্রুপের জন্য একবার করে চলবে (এক্ষেত্রে ২ বার)
    print(i)
    print(j)

A
  Category Store  Sales  Quantity       Date
0        A    S1    100        10 2023-01-01
2        A    S2    150        12 2023-01-03
4        A    S1    120         8 2023-01-05
6        A    S2    200        15 2023-01-07
B
  Category Store  Sales  Quantity       Date
1        B    S1    200        15 2023-01-02
3        B    S2    250        18 2023-01-04
5        B    S2    100        20 2023-01-06
7        B    S1    300        25 2023-01-08

In [ ]:
category = df.groupby("Category") 
category

In [13]:
category = df.groupby("Category") ["Sales"].sum()
category

Category
A    570
B    850
Name: Sales, dtype: int64

-> Group by Store and calculate the sum of sales

In [10]:
df

  Category Store  Sales  Quantity       Date
0        A    S1    100        10 2023-01-01
1        B    S1    200        15 2023-01-02
2        A    S2    150        12 2023-01-03
3        B    S2    250        18 2023-01-04
4        A    S1    120         8 2023-01-05
5        B    S2    100        20 2023-01-06
6        A    S2    200        15 2023-01-07
7        B    S1    300        25 2023-01-08

In [12]:
cat_by_store = df.groupby("Store") ["Sales"].sum()
cat_by_store

Store
S1    720
S2    700
Name: Sales, dtype: int64

-> Group by multiple columns (Category and Store)

In [16]:
cat = df.groupby(["Category", "Store"]) ["Sales"].sum()
cat

Category  Store
A         S1       220
          S2       350
B         S1       500
          S2       350
Name: Sales, dtype: int64

### AGGREGATION:

In [20]:
df

  Category Store  Sales  Quantity       Date
0        A    S1    100        10 2023-01-01
1        B    S1    200        15 2023-01-02
2        A    S2    150        12 2023-01-03
3        B    S2    250        18 2023-01-04
4        A    S1    120         8 2023-01-05
5        B    S2    100        20 2023-01-06
6        A    S2    200        15 2023-01-07
7        B    S1    300        25 2023-01-08

In [19]:
df["Sales"].mean()

np.float64(177.5)

In [21]:
df["Sales"].median()

175.0

In [25]:
df["Sales"].max()

300

In [26]:
df["Sales"].min()

100

In [27]:
df["Sales"].count()

np.int64(8)

In [29]:
df["Sales"].sum()

np.int64(1420)

aggregation function ->-> agg()

In [31]:
df["Sales"].agg(["sum", "mean", "median", "min", "max", "count", "std"])

sum       1420.000000
mean       177.500000
median     175.000000
min        100.000000
max        300.000000
count        8.000000
std         73.045974
Name: Sales, dtype: float64